docs/assign03.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-07-06 Tue 20:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SWE 619 Assignment 3</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ThanhVu (Vu) Nguyen" />
<link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org.css">
</head>
<body>
<div id="content">
<h1 class="title">SWE 619 Assignment 3</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc865e72">1. Goals: Data Abstraction / Mutability</a></li>
<li><a href="#org687ecdd">2. Grading Criteria</a></li>
<li><a href="#orgac95c86">3. Links</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgc865e72" class="outline-2">
<h2 id="orgc865e72"><span class="section-number-2">1</span> Goals: Data Abstraction / Mutability</h2>
<div class="outline-text-2" id="text-1">
<p>
Rewrite <a href="./files/MapPoly.java">MapPoly</a>, my map-based version Liskov's Poly so that it is <i>mutable</i>. Keep the same representation.
</p>

<p>
Rewrite the overview, the method signatures, the method specifications, and the methods themselves. You do not need to rewrite the abstraction function and representation invariant for this exercise.
</p>

<p>
Turn in a <b>story</b>. This means that it is possible to grade your assignment simply by reading it, as if it were part of a textbook. In particular, every place you make a decision to change something in the code (or not), you should have a description of what you did (or didn't do) and why you did (or didn't do) it.
</p>

<p>
Remember that part of your group is responsible for synthesizing a solution, and part of your group is responsible for checking the result.
</p>
</div>
</div>


<div id="outline-container-org687ecdd" class="outline-2">
<h2 id="org687ecdd"><span class="section-number-2">2</span> Grading Criteria</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Correct transformation of Poly</li>
<li>Clarity of your story.</li>
<li>Reasonable division of synthesis vs. checking.</li>
</ul>
</div>
</div>


<div id="outline-container-orgac95c86" class="outline-2">
<h2 id="orgac95c86"><span class="section-number-2">3</span> Links</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="./index.html">Syllabus</a></li>
<li><a href="./schedule.html">Schedule</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
